package main.java.com.eunah.section01.extend;

public class Application01 {
    public static void main(String[] args) {

        /* 상속은 현실 세계의 상속과 비슷한 개념이다.
           부모가 가지고 있는 재산(자바에서는 클래스 가지고 있는 멤버)를 자식이 물려받는 의미이다.
           클래스 또한 부모 클래스와 자식 클래스로 역할을 나누어서
           부모가 가지는 멤버를 자식이 물려받아 자기의 멤버인 것처럼 사용할 수 있도록 만든 기술이다.

           하지만 단순 물려받는 개념보다는 조금 더 나아가서 자바에서의 상속은 부모클래스의 확장(extend)의 개념을 가진다.
           물려받아서 자신의 것처럼 사용하는 것 뿐만 아니라 추가적인 멤버도 작성이 가능하다.
           특히 메소드 재정의(overriding) 이라는 기술을 이용해서 부모가 가진 메소드를 재정의 하는 것도 가능하다. */

        


    }
}
